In [2]:
import pandas as pd
#Empty DataFrame
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [7]:
emp=pd.Series(['Parker','John','Smith','William'])
id=pd.Series([102,107,109,114])
frame={'Emp':emp,'ID':id}
result=pd.DataFrame(frame)
print("\nSeries to Data frame\n")
print(result)

Series to Data frame

       Emp   ID
0   Parker  102
1     John  107
2    Smith  109
3  William  114

In [8]:
print("nAdding new column:\n")
result['Age']=pd.Series([35,24,40,38])
print(result)

nAdding new column:

       Emp   ID  Age
0   Parker  102   35
1     John  107   24
2    Smith  109   40
3  William  114   38

In [12]:
print("\nDeleting one column:\n")
del result['Age']
print(result)

Deleting one column:

       Emp   ID
0   Parker  102
1     John  107
2    Smith  109
3  William  114

In [13]:
print("\nExtrating the third row:\n")
print(result.loc[2])

Extrating the third row:

Emp    Smith
ID       109
Name: 2, dtype: object

In [14]:
print("\nSlice rows:\n",result[1:3])

Slice rows:
      Emp   ID
1   John  107
2  Smith  109

In [17]:
d2=pd.DataFrame([['Dale',123],['Mark',143]],columns=['Emp','ID'])
result=pd.concat([result,d2],ignore_index=True)
print("\nAdding new row values:\n",result)

Adding new row values:
        Emp   ID
0   Parker  102
1     John  107
2    Smith  109
3  William  114
4     Dale  123
5     Mark  143

In [18]:
print("\nDeleting particular row :\n",result.drop(1))

Deleting particular row :
        Emp   ID
0   Parker  102
2    Smith  109
3  William  114
4     Dale  123
5     Mark  143